class Error:
    class Register:
        code_1001 = 1001
        message_1001 = "کاربر قبلا ثبت شده است"

        code_1002 = 1002
        message_1002 = "خطا در ثبت کاربر"

        code_1003 = 1003
        message_1003 = "خطا در ایجاد توکن"

    class SMS:
        code_2000 = 2000
        message_2000 = "خطا داخلی در ارسال پیام کوتاه"

        code_2001 = 2001
        message_2001 = "کد تاییده قبلا ارسال شده است"

    class User:
        code_1004 = 1004
        message_1004 = "می بایست توکن ارسال گردد"

        code_1005 = 1005
        message_1005 = "توکن نامعتبر می باشد"

        code_1006 = 1006
        message_1006 = "توکن منقصی شده است"

        code_1007 = 1007
        message_1007 = "خطا در پیدا کردن کاربر"
